baseio-documents/load-test/load-test-http.txt
wangkai@wangkai-OptiPlex-9020:/var/apps/git-rep/microservices-framework-benchmark$ wrk -t8 -c128 -d15s http://localhost:8080 -s pipeline.lua --latency -- / 1024
Running 15s test @ http://localhost:8080
  8 threads and 128 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    38.68ms   27.21ms 200.09ms   64.67%
    Req/Sec   255.95k    57.25k  603.77k    77.41%
  Latency Distribution
     50%   36.10ms
     75%   59.63ms
     90%   86.82ms
     99%    0.00us
  30220290 requests in 15.09s, 3.74GB read
Requests/sec: 2002224.02
Transfer/sec:    253.96MB
wangkai@wangkai-OptiPlex-9020:/var/apps/git-rep/microservices-framework-benchmark$ wrk -t8 -c128 -d15s http://localhost:8080 -s pipeline.lua --latency -- / 1024
Running 15s test @ http://localhost:8080
  8 threads and 128 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    39.40ms   27.47ms 299.49ms   63.91%
    Req/Sec   253.24k    46.20k  468.96k    70.92%
  Latency Distribution
     50%   37.81ms
     75%   63.08ms
     90%   92.35ms
     99%    0.00us
  30424648 requests in 15.09s, 3.77GB read
Requests/sec: 2015639.02
Transfer/sec:    255.66MB
wangkai@wangkai-OptiPlex-9020:/var/apps/git-rep/microservices-framework-benchmark$